
/**
 * Якось нарешті жителі планети Земля знайшли заселену планету, назвали її ТТВ,
 * і відправили разом з кораблем туди одного кролика. Кролику сподобався клімат
 * нової планети і через місяць він народив на світ ще одного кролика. Відомо,
 * що кожен місяц кожен кролик, який був присутніс на планеті, відтворював на
 * світ ще одного кролика. На планеті звідкілясь завіся монстр, який на початку
 * місяця з'їдав k кроликів, як тільки їх ставало строго більше k. У задачі
 * необхідно визначити кількість кроликів, яка буде на планеті через n місяців
 * після прибуття на неї космічного корабля з першим кроликом.
 * 
 * 
 * Вхідні дані
 * 
 * Перший рядок містить кількість місяців n (0 ≤ n ≤ 100), другий - число
 * кроликів k(0 ≤ k ≤ 10000), яких з'їдав монстр.
 * 
 * Вихідні дані
 * 
 * Визначіть кількість кроликів, які будуть знаходитись на планеті ТТВ через n
 * місяців після поселення на неї першого кролика. Відомо, що результат для
 * довільного тесту завжди не перевищує 2*109.
 * 
 * @author Богдана
 *
 */
import java.io.IOError;

import java.io.IOException;
import java.io.InputStream;
import java.util.Scanner;

public class Main {

	public static void main(String[] args) throws IOException {
		Main obj=new Main();
		obj.beginProcess();

	}
	void beginProcess() throws IOException{
		Scanner in = new Scanner(System.in);
		while (in.hasNextInt()) {
			int n = in.nextInt();
			int k = in.nextInt();
			if ((n >=0 && n <= 100) && (k >=0 && k <=10000)) {
				System.out.println(rabbits(n, k));
			}
		}
	}

	public static int rabbits(int n, int k) {
		int am = 1;
		for (int i = 0; i < n; i++) {
			if (am > k)
				am = am - k;
			am = am * 2;

		}
		return am;

	}

}
